In [2]:
import pandas as pd 
import numpy as np

In [3]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}

In [4]:
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [5]:
one = pd.DataFrame(data_one)

In [6]:
two = pd.DataFrame(data_two)

In [7]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [8]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [12]:
pd.concat([one,two],axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [13]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [14]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [16]:
pd.concat([one,two], axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [17]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [18]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [19]:
two.columns = one.columns

In [20]:
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [22]:
mydf = pd.concat([one,two],axis=0)

In [23]:
mydf.index = range(len(mydf))

In [24]:
mydf

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3